---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidAreaLoadSketch
source: html/f4d60902-17ce-34b1-fa7d-b6b60540fd3c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.InvalidAreaLoadSketch Property

Area Load has invalid Sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidAreaLoadSketch { get; }
```